{"keras_version": "2.2.4", "config": {"layers": [{"config": {"batch_input_shape": [null, 24], "name": "embedding_1", "output_dim": 10, "trainable": true, "mask_zero": false, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 24, "input_dim": 3109, "dtype": "float32", "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"batch_input_shape": [null, 3109, 10, 1], "return_sequences": false, "name": "cu_dnnlstm_1", "recurrent_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "units": 150, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "activity_regularizer": null, "return_state": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "CuDNNLSTM"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 3109, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow"}