{"config": {"name": "sequential_1", "layers": [{"config": {"input_length": 23, "trainable": true, "batch_input_shape": [null, 23], "dtype": "float32", "embeddings_constraint": null, "output_dim": 10, "mask_zero": false, "activity_regularizer": null, "name": "embedding_1", "input_dim": 3929, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 3929, 10, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "return_sequences": false, "units": 150, "return_state": false, "dtype": "float32", "recurrent_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "stateful": false, "bias_regularizer": null, "name": "cu_dnnlstm_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "activity_regularizer": null}, "class_name": "CuDNNLSTM"}, {"config": {"name": "dropout_1", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 3929, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}