{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "output_dim": 10, "mask_zero": false, "embeddings_constraint": null, "name": "embedding_1", "batch_input_shape": [null, 79], "input_dim": 2853, "trainable": true, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "input_length": 79, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"kernel_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "stateful": false, "recurrent_regularizer": null, "name": "cu_dnnlstm_1", "batch_input_shape": [null, 2853, 10, 1], "units": 150, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "return_sequences": false, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "go_backwards": false, "bias_regularizer": null, "bias_constraint": null}, "class_name": "CuDNNLSTM"}, {"config": {"name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "units": 2853, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}